using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace Servis
{
    public class Konvertor
    {
        public static Dictionary<string, string> dict = new Dictionary<string, string>()
            {
                
                {"dj", "ђ"},
                {"lj", "љ"},
                {"nj", "њ"},
                {"dz", "џ"},
                {"dž", "џ"},

                {"đ", "ђ"},
                {"a", "а"},
                {"b", "б"},
                {"v", "в"},
                {"g", "г"},
                {"d", "д"},
                {"e", "е"},
                {"ž", "ж"},
                {"z", "з"},
                {"i", "и"},
                {"j", "ј"},
                {"k", "к"},
                {"l", "л"},
                {"m", "м"},
                {"n", "н"},
                {"o", "о"},
                {"p", "п"},
                {"r", "р"},
                {"s", "с"},
                {"t", "т"},
                {"u", "у"},
                {"f", "ф"},
                {"h", "х"},
                {"c", "ц"},
                {"č", "ч"},
                {"ć", "ћ"},
                {"š", "ш"},

                {"Dj", "Ђ"},
                {"Lj", "Љ"},
                {"Nj", "Њ"},
                {"Dz", "Џ"},
                {"Dž", "Џ"},

                {"Đ", "Ђ"},
                {"A", "А"},
                {"B", "Б"},
                {"V", "В"},
                {"G", "Г"},
                {"D", "Д"},
                {"E", "Е"},
                {"Ž", "Ж"},
                {"Z", "З"},
                {"I", "И"},
                {"J", "Ј"},
                {"K", "К"},
                {"L", "Л"},
                {"M", "М"},
                {"N", "Н"},
                {"O", "О"},
                {"P", "П"},
                {"R", "Р"},
                {"S", "С"},
                {"T", "Т"},
                {"U", "У"},
                {"F", "Ф"},
                {"H", "Х"},
                {"C", "Ц"},
                {"Č", "Ч"},
                {"Ć", "Ћ"},
                {"Š", "Ш"},

                {" ", " "},
                {",", ","},
                {".", "."},
                {"?", "?"},
                {"!", "!"},
                {"\"", "\""},
                {"@", "@"}
            };
    }
}